## ----echo=FALSE---------------------------------------------------------------
knitr::opts_chunk$set(echo = TRUE)

## ----echo=FALSE---------------------------------------------------------------
dataWeight<-data.frame("Feed"=c("A_1","A_2","A_3"),"W.1"=c(1073,1107,1093),"W.2"=c(1009,1092,1029),"w.3"=c(1060,990,1080),"W.4"=c(1001,1109,1021),"W.5"=c(1002,10900,1022),"W.6"=c(1012,1074,1032),"W.7"=c(1009,1122,1029),"W.8"=c(1028,1001,1048))
dataWeight

## -----------------------------------------------------------------------------
library(reshape)
data1<- melt(dataWeight,id="Feed")#数据整理
data1<- data1[,-2]

data1#数据展示，包括因子水平以及因子水平下鸡的重量
aov.chick=aov(value~Feed,data = data1)#做单因子方差分析
summary(aov.chick)##结果展示

## ----echo=FALSE---------------------------------------------------------------
F<-summary(aov.chick)[[1]][["F value"]][[1]]
p<-summary(aov.chick)[[1]][["Pr(>F)"]][[1]]
paste("该检验的F统计量的值为：",F,";对应的p值为：",p,"。",collapse = "//")

## -----------------------------------------------------------------------------
u<-runif(1000)#生成1000个服从U(0,1)的随机数
x<- -log(1-u)#x即是服从Exp(1)的随机样本
hist(x,prob=T,xlim=c(0,5),main=expression(f(x)==exp(-x)))
curve(exp(-x),col="red",add=T)#得到直方图与曲线

## ----echo=FALSE---------------------------------------------------------------
dataCarbon<-data.frame("x"=c(0.1,0.11,0.12,0.13,0.14,0.15,0.16,0.17,0.18,0.20,0.21,0.23),"y"=c(42,43,45,45,45,47.5,49,53,50,55,55,60))
dataCarbon

## -----------------------------------------------------------------------------
library(ggplot2)
sclm<-lm(y~x,data = dataCarbon)#，根据问题中给出的数据集dataCarbon建立线性模型
summary(sclm)#线性模型结果展示
ggplot(dataCarbon, aes(x, y))+
  geom_point()+
  geom_smooth(method = "lm", se = F)#绘图，绘制散点图叠加拟合曲线

